name: "Go_player"
layer {
    name: "data"
    type: "ImageData"
    top: "data"
    top: "label"
    include {
      phase: TEST
    }
    image_data_param {
      source: "dataset_test.txt"
      batch_size: 128
      shuffle: true
    }
}


layer {
    name: "conv1"
    type: "Convolution"
    bottom: "data"
    top: "conv1"  
    convolution_param {
      num_output: 64
      pad: 2
      kernel_size: 5
      stride: 1
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "relu1"
    type: "ReLU"
    bottom: "conv1"
    top: "relu1"
    relu_param{
      negative_slope: 0.01
    }
}

layer {
    name: "conv2"
    type: "Convolution"
    bottom: "relu1"
    top: "conv2"  
    convolution_param {
      num_output: 64
      pad: 2
      kernel_size: 5
      stride: 1
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "relu2"
    type: "ReLU"
    bottom: "conv2"
    top: "relu2"
    relu_param{
      negative_slope: 0.01
    }
}

layer {
    name: "conv3"
    type: "Convolution"
    bottom: "relu2"
    top: "conv3"  
    convolution_param {
      num_output: 64
      pad: 2
      kernel_size: 5
      stride: 1
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "relu3"
    type: "ReLU"
    bottom: "conv3"
    top: "relu3"
    relu_param{
      negative_slope: 0.01
    }
}

layer {
    name: "conv4"
    type: "Convolution"
    bottom: "relu3"
    top: "conv4"  
    convolution_param {
      num_output: 64
      pad: 2
      kernel_size: 5
      stride: 1
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "relu4"
    type: "ReLU"
    bottom: "conv4"
    top: "relu4"
    relu_param{
      negative_slope: 0.01
    }
}

layer {
    name: "conv5"
    type: "Convolution"
    bottom: "relu4"
    top: "conv5"  
    convolution_param {
      num_output: 1
      pad: 2
      kernel_size: 5
      stride: 1
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "relu5"
    type: "ReLU"
    bottom: "conv5"
    top: "relu5"
    relu_param{
      negative_slope: 0.01
    }
}

layer {
    name: "fc8"
    type: "InnerProduct"
    bottom: "relu5"
    top: "fc8"   
 
    inner_product_param {
      num_output: 362  
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
}

layer {
    name: "output_class"
    type: "ArgMax"
    bottom: "fc8"
    top: "output_class"
    include {
      phase: TEST
    }
    argmax_param{
      top_k: 1
    }
}

layer {
    name: "test_accuracy"
    type: "Accuracy"
    bottom: "fc8"
    bottom: "label"
    top: "test_accuracy"
      include {
        phase: TEST
      }
    accuracy_param {
      top_k: 1
    }
}

layer {
    name: "prob"
    type: "SoftmaxWithLoss"
    bottom: "fc8"
    bottom: "label"
    top: "prob"
}

layer {
  name: "testAccuracy"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "testAccuracy"
  accuracy_param {
    top_k: 1
  }
}
